[
  {
    "id": 1,
    "title": "Project Management System",
    "requirements": "A project manager uses the project management system to manage a project. The project manager leads a team to execute the project within the project's start and end dates. Once a project is created in the project management system, a manager may initiate and later terminate the project due to its completion or for some other reason. As input, a project uses requirements. As output, a project produces a system (or part of a system). The requirements and system are work products: things that are created, used, updated, and elaborated on throughout a project. Every work product has a description, is of some percent complete throughout the effort, and may be validated. However, validation is dependent on the type of work product. For example, the requirements are validated with users in workshops, and the system is validated by being tested against the requirements. Furthermore, requirements may be published using various types of media, including on an intranet or in paper form; and systems may be deployed onto specific platforms.",
    "diagram": "@startuml\nclass Manager {\n  Name\n  Phone Number\n}\nclass Project {\n  End Date\n  Name\n  Start Date\n}\nclass Requirement {\n  Media\n}\nclass System {\n  Platform\n}\nclass Team {\n  Description\n}\nclass \"Work Product\" {\n  Description\n  Percent Complete\n}\nManager --> Team\nProject --> Manager\nProject --> Team\nRequirement --> Project\nSystem --> Project\n\"Work Product\" <|-- Requirement\n\"Work Product\" <|-- System\n@enduml"
  },
  {
    "id": 2,
    "title": "Hollywood Approach",
    "requirements": "We are interested in building a software application to manage filmed scenes for realizing a movie, by following the so-called “Hollywood Approach”. Every scene is identified by a code (a string) and it is described by a text in natural language. Every scene is filmed from different positions (at least one), each of this is called a setup. Every setup is characterized by a code (a string) and a text in natural language where the photographic parameters are noted (e.g., aperture, exposure, focal length, filters, etc.). Note that a setup is related to a single scene. For every setup, several takes may be filmed (at least one). Every take is characterized by a (positive) natural number, a real number representing the number of meters of film that have been used for shooting the take, and the code (a string) of the reel where the film is stored. Note that a take is associated to a single setup. Scenes are divided into internals that are filmed in a theater, and externals that are filmed in a location and can either be “day scene” or “night scene”. Locations are characterized by a code (a string) and the address of the location, and a text describing them in natural language.",
    "diagram": "@startuml\nclass External {\n  night_scene\n}\nclass Internal {\n  theater\n}\nclass Location {\n  address\n  description\n  name\n}\nclass Scene {\n  code\n  description\n}\nclass Setup {\n  code\n  photographic_pars\n}\nclass Take {\n  filmed_meters\n  nbr\n  reel\n}\nExternals --> Location\nSetup --> Scene\nTake --> Setup\nScene <|-- Extenal\nScene <|-- Internal\n@enduml"
  },
  {
    "id": 3,
    "title": "Word Processor",
    "requirements": "A user can open a new or existing document. Text is entered through a keyboard. A document is made up of several pages and each page is made up of a header, body and footer. Date, time and page number may be added to header or footer. Document body is made up of sentences, which are themselves made up of words and punctuation characters. Words are made up of letters, digits and/or special characters. Pictures and tables may be inserted into the document body. Tables are made up of rows and columns and every cell in a table can contain both text and pictures. Users can save or print documents.",
    "diagram": "@startuml\nclass Cell {\n  cellFormat\n}\nclass Character {\n  ASCIICode\n  Type\n}\nclass Document {\n  numberofpages\n}\nclass Page {\n  pageNumber\n}\nclass Picture {\n  imageSize\n  imageType\n}\nclass Table {\n  columns\n  rows\n}\nclass Trimming {\n  date\n  pageNumber\n  time\n}\nCell o-- Character\nCell o-- Picture\nPage o-- Character\nPage o-- Picture\nPage o-- Table\nPage o-- Trimming\nDocument *-- Page\nTable *-- Cell\n@enduml"
  }
]
