[
  {
    "id": 1,
    "title": "Project Management System",
    "requirements": "A project manager uses the project management system to manage a project. The project manager leads a team to execute the project within the project's start and end dates. Once a project is created in the project management system, a manager may initiate and later terminate the project due to its completion or for some other reason. As input, a project uses requirements. As output, a project produces a system (or part of a system). The requirements and system are work products: things that are created, used, updated, and elaborated on throughout a project. Every work product has a description, is of some percent complete throughout the effort, and may be validated. However, validation is dependent on the type of work product. For example, the requirements are validated with users in workshops, and the system is validated by being tested against the requirements. Furthermore, requirements may be published using various types of media, including on an intranet or in paper form; and systems may be deployed onto specific platforms.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Manager (Name: String, Phone Number: String)\n- Project (Name: String, Start Date: Date, End Date: Date)\n- Requirement (Media: String)\n- System (Platform: String)\n- Team (Description: String)\n- Work Product (Description: String, Percent Complete: Integer)\n\n### Relationships:\n- Manager leads Team\n- Project is managed by Manager\n- Project involves Team\n- Requirement is a type of Work Product\n- System is a type of Work Product\n- Requirement is input for Project\n- System is output for Project",
    "diagram": "@startuml\nclass Manager {\n  Name\n  Phone Number\n}\nclass Project {\n  End Date\n  Name\n  Start Date\n}\nclass Requirement {\n  Media\n}\nclass System {\n  Platform\n}\nclass Team {\n  Description\n}\nclass \"Work Product\" {\n  Description\n  Percent Complete\n}\nManager --> Team\nProject --> Manager\nProject --> Team\nRequirement --> Project\nSystem --> Project\n\"Work Product\" <|-- Requirement\n\"Work Product\" <|-- System\n@enduml"
  },
  {
    "id": 2,
    "title": "Hollywood Approach",
    "requirements": "We are interested in building a software application to manage filmed scenes for realizing a movie, by following the so-called “Hollywood Approach”. Every scene is identified by a code (a string) and it is described by a text in natural language. Every scene is filmed from different positions (at least one), each of this is called a setup. Every setup is characterized by a code (a string) and a text in natural language where the photographic parameters are noted (e.g., aperture, exposure, focal length, filters, etc.). Note that a setup is related to a single scene. For every setup, several takes may be filmed (at least one). Every take is characterized by a (positive) natural number, a real number representing the number of meters of film that have been used for shooting the take, and the code (a string) of the reel where the film is stored. Note that a take is associated to a single setup. Scenes are divided into internals that are filmed in a theater, and externals that are filmed in a location and can either be “day scene” or “night scene”. Locations are characterized by a code (a string) and the address of the location, and a text describing them in natural language.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Scene (code: String, description: String)\n- Setup (code: String, photographic_pars: String)\n- Take (nbr: Integer, filmed_meters: Real, reel: String)\n- Internal (theater: String)\n- External (night_scene: Boolean)\n- Location (name: String, address: String, description: String)\n\n### Relationships:\n- Setup belongs to one Scene\n- Take belongs to one Setup\n- Internal is a type of Scene\n- External is a type of Scene\n- External is filmed at a Location",
    "diagram": "@startuml\nclass External {\n  night_scene\n}\nclass Internal {\n  theater\n}\nclass Location {\n  address\n  description\n  name\n}\nclass Scene {\n  code\n  description\n}\nclass Setup {\n  code\n  photographic_pars\n}\nclass Take {\n  filmed_meters\n  nbr\n  reel\n}\nExternals --> Location\nSetup --> Scene\nTake --> Setup\nScene <|-- Extenal\nScene <|-- Internal\n@enduml"
  },
  {
    "id": 3,
    "title": "Word Processor",
    "requirements": "A user can open a new or existing document. Text is entered through a keyboard. A document is made up of several pages and each page is made up of a header, body and footer. Date, time and page number may be added to header or footer. Document body is made up of sentences, which are themselves made up of words and punctuation characters. Words are made up of letters, digits and/or special characters. Pictures and tables may be inserted into the document body. Tables are made up of rows and columns and every cell in a table can contain both text and pictures. Users can save or print documents.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Document (numberofpages: Integer)\n- Page (pageNumber: Integer)\n- Trimming (date: Date, time: Time, pageNumber: Integer)\n- Character (ASCIICode: String, Type: String)\n- Picture (imageSize: Integer, imageType: String)\n- Table (rows: Integer, columns: Integer)\n- Cell (cellFormat: String)\n\n### Relationships:\n- Document is composed of Pages\n- Page contains Trimmings (Header/Footer)\n- Page contains Characters, Pictures, and Tables\n- Table is composed of Cells\n- Cell contains Characters and Pictures",
    "diagram": "@startuml\nclass Cell {\n  cellFormat\n}\nclass Character {\n  ASCIICode\n  Type\n}\nclass Document {\n  numberofpages\n}\nclass Page {\n  pageNumber\n}\nclass Picture {\n  imageSize\n  imageType\n}\nclass Table {\n  columns\n  rows\n}\nclass Trimming {\n  date\n  pageNumber\n  time\n}\nCell o-- Character\nCell o-- Picture\nPage o-- Character\nPage o-- Picture\nPage o-- Table\nPage o-- Trimming\nDocument *-- Page\nTable *-- Cell\n@enduml"
  },
  {
    "id": 4,
    "title": "Patient Record and Scheduling",
    "requirements": "A patient record and scheduling system in a doctor’s oﬃce is used by the receptionists, nurses, and doctors. The receptionists use the system to enter new patient information when first-time patients visit the doctor. They also schedule all appointments. The nurses use the system to keep track of the results of each visit including diagnosis and medications. For each visit, free form text fields are used captures information on diagnosis and treatment. Multiple medications may be prescribed during each visit. The nurses can also access the information to print out a history of patient visits. The doctors primarily use the system to view patient history. The doctors may enter some patient treatment information and prescriptions occasionally, but most frequently they let the nurses enter this information. -- Each patient is assigned to a family. The head of family is responsible for the person with the primary medical coverage. Information about doctors is maintained since a family has a primary care physician, but different doctors may be the ones seeing the patient during the visit.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Patient (Name: String, Gender: String, Birthdate: Date, LastVisitDate: Date, Allergies: String, Notes: String)\n- FamilyInsured (NameofFamilyHead: String, Address: String, Telephone: String, InsuranceCarrier: String, PolicyNumber: String)\n- Doctor (Name: String, Address: String, Telephone: String, SSN: String, Specialty: String, PagerNumber: String)\n- Visit (Date: Date, Reason: String, Weight: Real, Temperature: Real, BloodPressure: String, DiagnosisNotes: String, TreatmentNotes: String)\n- Appointment (Date: Date, Time: Time, Reason: String)\n- Prescription (Number: String, Date: Date, Medication: String, Dosage: String)\n\n### Relationships:\n- Patient belongs to a FamilyInsured\n- FamilyInsured has a primary Doctor\n- Patient has Appointments\n- Patient has Visits\n- Visit is linked to an Appointment\n- Visit produces Prescriptions\n- Doctor performs Visits",
    "diagram": "@startuml\nclass Appointment {\n  Date\n  Reason\n  Time\n}\nclass Doctor {\n  Address\n  Name\n  PagerNumber\n  SSN\n  Specialty\n  Telephone\n}\nclass FamilyInsured {\n  Address\n  InsuranceCarrier\n  NameofFamilyHead\n  PolicyNumber\n  Telephone\n}\nclass Patient {\n  Allergies\n  Birthdate\n  Gender\n  LastVisitDate\n  Name\n  Notes\n}\nclass Prescription {\n  Date\n  Dosage\n  Medication\n  Number\n}\nclass Visit {\n  BloodPressure\n  Date\n  DiagnosisNotes\n  Reason\n  Temperature\n  TreatmentNotes\n  Weight\n}\nDoctor --> Visit\nFamilyInsured --> Doctor\nFamilyInsured --> Patient\nPatient --> Appointment\nPatient --> Visit\nVisit --> Appointment\nVisit --> Prescription\n@enduml"
  },
  {
    "id": 5,
    "title": "Movie-Shop",
    "requirements": "Design a system for a movie-shop, in order to handle ordering of movies and browsing of the catalogue of the store, and user subscriptions with rechargeable cards. Only subscribers are allowed hiring movies with their own card. Credit is updated on the card during rent operations. Both users and subscribers can buy a movie and their data are saved in the related order. When a movie is not available it is ordered ",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- User (name: String, surname: String)\n- Subscriber (address: String, phone: String)\n- Card (code: String, credit: Real)\n- Movie (name: String, type: String)\n- Movie-Buy (status: String, Price-Sell: Real)\n- Movie-Rent (date: Date, status: String, Price: Real)\n- Order (date: Date, user: String)\n- Movie-Shop\n\n### Relationships:\n- Subscriber is a type of User\n- Subscriber has a Card\n- User buys a Movie-Buy\n- Subscriber rents a Movie-Rent\n- Movie-Buy is a type of Movie\n- Movie-Rent is a type of Movie\n- Order contains Movie-Buy\n- User interacts with Movie-Shop",
    "diagram": "@startuml\nclass Card {\n  code\n  credit\n}\nclass Movie {\n  name\n  type\n}\nclass \"Movie-Buy\" {\n  Price-Sell\n  status\n}\nclass \"Movie-Rent\" {\n  Price\n  date\n  status\n}\nclass \"Movie-Shop\" {\n}\nclass Order {\n  date\n  user\n}\nclass Subscriber {\n  address\n  phone\n}\nclass User {\n  name\n  surname\n}\nMovie o-- \"Shop - Movie\"\nMovie --> \"Shop - Card\"\nMovie --> \"Shop - Order\"\nOrder --> \"Movie-Buy\"\nSubscriber --> Card\nSubscriber --> \"Movie-Rent\"\nUser --> \"Movie-Buy\"\nUser --> \"Movie-Shop\"\nMovie <|-- \"Movie-Buy\"\nMovie <|-- \"Movie-Rent\"\nUser <|-- Subscriber\n@enduml"
  },
  {
    "id": 6,
    "title": "Flights",
    "requirements": "We want to model a system for management of ﬂights and pilots. An airline operates ﬂights. Each airline has an ID. Each ﬂight has an ID a departure airport and an arrival airport: an airport as a unique identifier. Each ﬂight has a pilot and a co-pilot, and it uses an aircraft of a certain type; a flight has also a departure time and an arrival time. An airline owns a set of aircrafts of different types. An aircraft can be in a working state or it can be under repair. In a particular moment an aircraft can be landed or airborne. A company has a set of pilots: each pilot has an experience level: 1 is minimum, 3 is maximum. A type of aeroplane may need a particular number of pilots, with a diﬀerent role (e.g.: captain, co-pilot, navigator): there must be at least one captain and one co-pilot, and a captain must have a level 3.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Airline (ID: String, Name: String)\n- Flight (ID: String, departure_time: DateTime, arrival_time: DateTime)\n- Airport (ID: String, name: String)\n- Aircraft (Name: String, repair: Boolean, landed: Boolean)\n- AircraftType (name: String)\n- Pilot (name: String)\n- Pilot 1\n- Pilot 2\n- Pilot 3\n\n### Relationships:\n- Airline operates Flights\n- Airline owns Aircraft\n- Flight connects two Airports (Departure/Arrival)\n- Flight uses an Aircraft\n- Flight has Pilots\n- Aircraft belongs to an AircraftType\n- Pilot 1, 2, and 3 are types of Pilots\n- Pilot is certified for AircraftType",
    "diagram": "@startuml\nclass Aircraft {\n  Name\n  landed\n  repair\n}\nclass AircraftType {\n  name\n}\nclass Airline {\n  ID\n  Name\n}\nclass Airport {\n  ID\n  name\n}\nclass Flight {\n  ID\n  arrival_time\n  departure_time\n}\nclass Pilot {\n  name\n}\nclass \"Pilot 1\" {\n}\nclass \"Pilot 2\" {\n}\nclass \"Pilot 3\" {\n}\nAircraft --> \"Aircraft Type\"\n\"Aircraft Type\" --> \"Pilot 3\"\n\"Aircraft Type\" --> Pilot\nAirline --> Aircraft\nAirline --> Flight\nAirport --> Flight\nFlight --> Aircraft\nFlight --> Airport\nFlight --> Pilot\nPilot --> \"Aircraft Type\"\nPilot <|-- Pilot1\nPilot <|-- Pilot2\nPilot <|-- Pilot3\n@enduml"
  },
  {
    "id": 7,
    "title": "Bank System",
    "requirements": "A bank system contains data on customers (identiﬁed by name and address) and their accounts. Each account has a balance and there are 2 type of accounts: one for savings which oﬀers an interest rate, the other for investments, used to buy stocks. Stocks are bought at a certain quantity for a certain price (ticker) and the bank applies commission on stock orders.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Customer (Name: String, Address: String)\n- Account (CashBalance: Real)\n- SavingAccount (interestRate: Real)\n- InvestmentAccount\n- Stock (ticker: String, quantity: Integer)\n- StockOrder (commission: Real)\n\n### Relationships:\n- Customer owns Account\n- SavingAccount is a type of Account\n- InvestmentAccount is a type of Account\n- InvestmentAccount holds Stocks\n- Stock is managed via StockOrder",
    "diagram": "@startuml\nclass Account {\n  CashBalance\n}\nclass Customer {\n  Address\n  Name\n}\nclass InvestmentAccount {\n}\nclass SavingAccount {\n  interestRate\n}\nclass Stock {\n  quantity\n  ticker\n}\nclass StockOrder {\n  commission\n}\nCustomer --> Account\nInvestmentAccount --> Stock\nStock --> StockOrder\nAccount <|-- InvestmentAccount\nAccount <|-- SavingAccount\n@enduml"
  },
  {
    "id": 8,
    "title": "Veterinary Clinic",
    "requirements": "The owner of a veterinary clinic wants to create a database to store information about all veterinary services performed. After some research he came up with the following requirements:\n    - For each admitted animal, its name, breed (if any) and owner must be stored. Each animal should be given an unique numeric identifier.\n    - For each owner, its name, address and phone number should be stored. An unique numeric identifier should also be generated for each one of them.\n    - An animal might be owner-less. This happens frequently as the clinic often rescues abandoned dogs from the streets in order to treat them and get them new owners.- It should be possible to store information about a specific breed even if no animals of that breed have been treated at the clinic.\n    - Each appointment always has a responsible physician. All appointments start at a certain date and time; and are attended by an animal (and of course its owner).\n    - For each physician, his name, address and phone number should be stored. An unique numeric identifier should also be generated for each one of them.\n    - In an appointment, several medical conditions might be detected. Each condition has a common name and a scientific name. No two conditions have the same scientific name.\n    - It should be possible to store information about the most common conditions for each different breed in the database.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (ID: Integer, Name: String, Address: String, Phone: String)\n- Owner\n- Physician\n- Animal (ID: Integer, Name: String)\n- Breed (Name: String)\n- Appointment (Date: Date, Time: Time)\n- Condition (Common_Name: String, Sci_Name: String)\n\n### Relationships:\n- Owner is a type of Person\n- Physician is a type of Person\n- Animal has one Breed\n- Animal may have an Owner\n- Appointment involves an Animal, a Physician, and can detect Conditions\n- Breed is associated with common Conditions",
    "diagram": "@startuml\nclass Animal {\n  ID\n  Name\n}\nclass Appointment {\n  Date\n  Time\n}\nclass Breed {\n  Name\n}\nclass Condition {\n  Common_Name\n  Sci_Name\n}\nclass Owner {\n}\nclass Person {\n  Address\n  ID\n  Name\n  Phone\n}\nclass Physician {\n}\nAnimal --> Appointment\nAnimal --> Breed\nAnimal --> Owner\nAppointment --> Condition\nAppointment --> Physician\nBreed --> Condition\nOwner <|-- Person\nPhysician --> Person\n@enduml"
  },
  {
    "id": 9,
    "title": "Auto Repair",
    "requirements": "An auto repair shop that sells and mounts parts and accessories for all kinds of vehicles wants a new information system to manage their clients, parts, accessories, and assembly services. After some research, they came up with the following requirements:\n    - There are several employees. Each one of them has a unique identifying number, a name, and an address.\n    - In this shop, assembly services, where parts and accessories are installed in a vehicle, are executed. For each of these services, the following data must be stored: in which car the service was executed, how many kms the car had at the time, who was the responsible employee, which parts and accessories were fitted, how many work hours it took, and the admission and finish dates.\n    - Parts and accessories are only sold together with an assembly service.\n    - Each part/accessory only fits in some car models. Therefore, it is important to store that information.\n    - Each part/accessory has a category (radio, tyre, …), a serial number, and a price.\n    - Each car has a license plate, a make, a model, a color, and an owner.\n    - Each owner has a name, identifying number, address, and a phone.\n    - One person can own more than one car, but one car only has one owner.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (ID: Integer, Name: String, Address: String)\n- Employee\n- Owner\n- Car (Plate: String, Color: String)\n- Car Model\n- Make (Name: String)\n- Service (Adm_Date: Date, Finish_Date: Date, Car_Km: Integer, Hours_spent: Integer)\n- Part/Acc (Serial_No: String, Price: Real)\n- Part Type (Current_Price: Real)\n\n### Relationships:\n- Employee is a type of Person\n- Owner is a type of Person\n- Car belongs to an Owner\n- Car is a specific Car Model\n- Car Model is produced by a Make\n- Service is performed on a Car by an Employee\n- Service uses Parts/Acc\n- Part/Acc is of a specific Part Type\n- Part Type is compatible with Car Models",
    "diagram": "@startuml\nclass Car {\n  Color\n  Plate\n}\nclass \"Car Model\" {\n}\nclass Employee {\n}\nclass Make {\n  Name\n}\nclass Owner {\n}\nclass \"Part Type\" {\n  Current_Price\n}\nclass \"Part/Acc\" {\n  Price\n  Serial_No\n}\nclass Person {\n  Address\n  ID\n  Name\n}\nclass Service {\n  Adm_Date\n  Car_Km\n  Finish_Date\n  Hours_spent\n}\nEmployee --> Service\nCar --> \"Car Model\"\n\"Car Model\" --> Make\n\"Car Model\" --> \"Part Type\"\nOwner --> Car\n\"Part/Acc\" --> \"Part Type\"\nService --> Car\nService --> \"Part/Acc\"\nEmployee <|-- Person\nOwner <|-- Person\n@enduml"
  },
  {
    "id": 10,
    "title": "Restaurant",
    "requirements": "The owner of a small restaurant wants a new information system to store data for all meals consumed there and also to keep a record of ingredients kept in stock. After some research he reached the following requirements list:\n    - Each ingredient has a name, a measuring unit (e.g. olive oil is measured in liters, while eggs are unit based) and a quantity in stock. There are no two ingredients with the same name. Each dish is composed of several ingredients in a certain quantity. An ingredient can, of course, be used in different dishes.\n    - A dish has a unique name and a numeric identifier.\n    - There are several tables at the restaurant. Each one of them has a unique numeric identifier and a maximum amount of people that can be seated there.\n    - In each meal, several dishes are consumed at a certain table. The same dish can be eaten more than once in the same meal.\n    - A meal takes place in a certain date and has a start and end time. Each meal has a responsible waiter.\n    - A waiter has a unique numerical identifier, a name, an address and a phone number.\n    - In some cases it is important to store information about the client that consumed the meal. A client has a tax identification number, a name and an address.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (Name: String, Address: String)\n- Client (Tax_ID: String)\n- Waiter (ID: Integer, Phone: String)\n- Table (ID: Integer, Capacity: Integer)\n- Meal (Date: Date, StartTime: Time, EndTime: Time)\n- Dish (ID: Integer, Name: String)\n- Ingredient (Name: String, Unit: String, Stock: Real)\n\n### Relationships:\n- Client is a type of Person\n- Waiter is a type of Person\n- Meal is served at a Table by a Waiter\n- Meal is consumed by a Client\n- Meal consists of Dishes\n- Dish is composed of Ingredients",
    "diagram": "@startuml\nclass Client {\n  Tax_ID\n}\nclass Dish {\n  ID\n  Name\n}\nclass Ingredient {\n  Name\n  Stock\n  Unit\n}\nclass Meal {\n  Date\n  EndTime\n  StartTime\n}\nclass Person {\n  Address\n  Name\n}\nclass Table {\n  Capacity\n  ID\n}\nclass Waiter {\n  ID\n  Phone\n}\nClient --> Meal\nDish --> Ingredient\nMeal --> Dish\nMeal --> Table\nWaiter --> Meal\nPerson <|-- Client\nPerson <|-- Waiter\n@enduml"
  },
  {
    "id": 11,
    "title": "Deliveries",
    "requirements": "The owner of a small delivery company plans to have an information system that allows him to save data about his customers and deliveries. After some time studying the problem, he reached the following requirements:\n    - Each customer has a VAT number, a name, a phone number and an address. There are no two clients with the same VAT number.\n    - When a customer wants to send a package to another customer, he just has to login to the company website, select the customer he wants to send the package to, enter the package's weight and if the delivery is normal or urgent. He then receives a unique identifier code that he writes on the package.\n    - The package is then delivered by the customer at the delivery center of his choosing. A delivery center has a unique name and an address.\n    - Each client has an associated delivery center. This delivery center is chosen by the company and it is normally the one closest to the customer's house.\n    - The package is then routed through an internal system until it reaches the delivery center of the recipient.\n    - The package is then delivered by hand from that delivery center to the recipient by a courier.\n    - Couriers have a single VAT number, a name and a phone number. Each courier works in a single delivery center.\n    - A courier is assigned to a package as soon as the package is introduced in the system.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (VAT: String, Name: String, Phone: String)\n- Customer (Address: String)\n- Courier\n- Package (ID: String, Weight: Real, Urgency: String)\n- DeliveryCenter (Name: String, Address: String)\n\n### Relationships:\n- Customer is a type of Person\n- Courier is a type of Person\n- Package is sent by a Customer to another Customer\n- Package is handled by a DeliveryCenter\n- Courier works at a DeliveryCenter\n- Courier is assigned to a Package\n- Customer is associated with a DeliveryCenter",
    "diagram": "@startuml\nclass Courier {\n}\nclass Customer {\n  Address\n}\nclass DeliveryCenter {\n  Address\n  Name\n}\nclass Package {\n  ID\n  Urgency\n  Weight\n}\nclass Person {\n  Name\n  Phone\n  VAT\n}\nCourier --> DeliveryCenter\nCourier --> Package\nCustomer --> DeliveryCenter\nCustomer --> Package\nCustomer --> Package\nDeliveryCenter --> Package\nDeliveryCenter --> Package\nPerson <|-- Courier\nPerson <|-- Customer\n@enduml"
  },
  {
    "id": 12,
    "title": "Furniture Factory Management",
    "requirements": "The known furniture factory Hi-Key-Ah, intends to implement an information system to store all data on the different types of furniture and components it produces. After some research, they came up with the following requirements:\n    - The factory produces several lines of furniture, each with a different name and consisting of several pieces of furniture of different types (beds, tables, chairs, …).\n    - All furniture pieces have a type, a single reference (eg CC6578) and a selling price.\n    - The major competitive advantage of this innovative plant is the fact that each component produced can be used in more than one piece of furniture.\n    - Each piece of furniture is thus composed of several components. The same component can be used more than once in the same piece.\n    - Every type of component produced is assigned a unique numerical code, a manufacturing price and a type (screw, hinge, shelf …).\n    - The furniture is then sold in various stores throughout the world. Each store has a different address and a fax number.\n    - To make the manufacturing process more efficient, stores have to place orders every time they need to replenish their stock. These orders must also be stored in the database.\n    - Each order has a order number, a date, the store that placed the order as well as a list of all the ordered furniture and their quantities.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Line (Type: String)\n- Piece (Ref: String, Price: Real)\n- Component (Code: String, Price: Real)\n- ComponentType (Name: String)\n- Store (Name: String, Address: String, FAX: String)\n- Order (Number: String, Date: Date)\n\n### Relationships:\n- Line consists of Pieces\n- Piece is composed of Components\n- Component is of a ComponentType\n- Store places Orders\n- Order contains Pieces",
    "diagram": "@startuml\nclass Component {\n  Code\n  Price\n}\nclass ComponentType {\n  Name\n}\nclass Line {\n  Type\n}\nclass Order {\n  Date\n  Number\n}\nclass Piece {\n  Price\n  Ref\n}\nclass Store {\n  Address\n  FAX\n  Name\n}\nComponent --> ComponentType\nOrder --> Piece\nPiece --> Component\nPiece --> Line\nStore --> Order\n@enduml"
  },
  {
    "id": 13,
    "title": "Industrial Factory Operations",
    "requirements": "Create a database for a factory with the following requirements. Don't forget to add unique identifiers for each one of the entities if needed. After some research, they came up with the following requirements:\n    - A factory has several machines. Each one of them is operated by several workers.\n    - A worker might work in more than one machine.\n    - In this factory, several products of different types, are produced. Each different type of product is produced in a single machine. But, the same machine can produce more than one type of product.\n    - Products from the same type are all produced from the same single material and have the same weight.\n    - Clients can issue purchase orders. Each order has a list of the desired products and their quantity.\n    - For each worker, the following data should be stored in the database: name (first and last), birth date, address and a list of his skills.\n    - For each machine, the following data should be stored: serial number, make, model and purchase date.\n    - For each client, the following data should be stored: name, address, phone number and name of the contact person (if any).\n    - For each purchase order, the following data should be stored: order number, date it has been made, expected and actual delivery date.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (FirstName: String, Surname: String, Address: String)\n- Worker (Birth_Date: Date)\n- Client (Phone: String, Contact_Person: String)\n- Machine (Serial: String, Make: String, Model: String, Purchase_Date: Date)\n- Product_Type (Material: String, Weight: Real)\n- Product (ID: String, Name: String)\n- Skill (Name: String)\n- Purchase Order (Number: String, Date: Date, Expected_Del: Date, Actual_Del: Date)\n\n### Relationships:\n- Worker is a type of Person\n- Client is a type of Person\n- Worker operates Machine\n- Worker has Skills\n- Machine produces Product_Type\n- Product_Type defines Products\n- Client places Purchase Order\n- Purchase Order contains Products",
    "diagram": "@startuml\nclass Client {\n  Contact_Person\n  Phone\n}\nclass Machine {\n  Make\n  Model\n  Purchase_Date\n  Serial\n}\nclass Person {\n  Address\n  FirstName\n  Surname\n}\nclass Product {\n  ID\n  Name\n}\nclass Product_Type {\n  Material\n  Weight\n}\nclass \"Purchase Order\" {\n  Actual_Del\n  Date\n  Expected_Del\n  Number\n}\nclass Skill {\n  Name\n}\nclass Worker {\n  Birth_Date\n}\nClient --> \"Purchase Order\"\nMachine --> Product_Type\nProduct --> \"Purchase Order\"\nProduct_Type --> Product\nWorker --> Machine\nWorker --> Skill\nPerson <|-- Client\nPerson <|-- Worker\n@enduml"
  },
  {
    "id": 14,
    "title": "Bycicle Rental",
    "requirements": "A bicycle renting company wants to create an information system that allows it to store the data regarding all their reservations and rentals. The system should follow these requirements. After some research, they came up with the following requirements:\n    - It should be possible to store the national id number (NIN), tax identification number (TIN), name and address for every client. The NIN and TIN must be different for every client and all clients should have at least a TIN and a name.\n    - The database should also contain information about the bicycle models that can be rented. Each model has a unique name, a type (that can only be road, mountain, bmx or hybrid) and the number of gears.\n    - Each bicycle has a unique identifying number and a model.\n    - The company has several different stores where bicycles can be picked up and returned. Each one of these stores is identified by a unique name and has an address (both mandatory).\n    - When a reservation is made, the following data must be known: which client did the reservation, when will he pick up the bike (day), which bike model he wants and where will he pick up the bike (store).\n    - When a bike is picked up, the actual bike that was picked up must be stored in the database.\n    - When a bike is returned, the return date should be stored in the database.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Client (Nin: String, Tin: String, Name: String, Address: String)\n- BicycleModel (Name: String, Type: String, No_Gears: Integer)\n- Bicycle (Number: String)\n- Store (Name: String, Address: String)\n- Reservation (Pickup_Day: Date, Return_Day: Date)\n\n### Relationships:\n- Bicycle is an instance of a BicycleModel\n- Client makes a Reservation\n- Reservation is for a BicycleModel\n- Reservation specifies a Store\n- Reservation eventually assigns a specific Bicycle",
    "diagram": "@startuml\nclass Bicycle {\n  Number\n}\nclass BicycleModel {\n  Name\n  No_Gears\n  Type\n}\nclass Client {\n  Address\n  Name\n  Nin\n  Tin\n}\nclass Reservation {\n  Pickup_Day\n  Return_Day\n}\nclass Store {\n  Address\n  Name\n}\nBicycle --> BycicleModel\nClient --> Reservation\nReservation --> Bicycle\nReservation --> BicycleModel\nReservation --> Store\n@enduml"
  },
  {
    "id": 15,
    "title": "Car Park Access System",
    "requirements": "Saturn Int. management wants to improve their security measures, both for their building and on site. They would like to prevent people who are not part of the company to use their car park. After some research, they came up with the following requirements:\n    - Saturn Int. has decided to issue identity cards to all employees. Each card records the name, department and number of a company staff, and give them access to the company car park. Employees are asked to wear the cards while on the site.\n    - There is a barrier and a card reader placed at the entrance to the car park. When a driver drives his car into the car park, he/she inserts his or her identity card into the card reader. The card reader then verify the card number to see if it is known to the system. If the number is recognized, the reader sends a signal to trigger the barrier to rise. The driver can then drive his/her car into the car park.\n    - There is another barrier at the exit of the car park, which is automatically raised when a car wishes to leave the car park.\n    - A sign at the entrance display \"Full\" when there are no spaces in the car park. It is only switched off when a car leaves.\n    - There is another type of card for guests, which also permits access to the car park. The card records a number and the current date. Such cards may be sent out in advance, or collected from reception. All guest cards must be returned to reception when the visitor leaves Saturn Int.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Car Park\n- Card\n- Staff Card (Name: String, Department: String, Number: String)\n- Guest Card (Number: String, Date: Date)\n- Card Reader\n- Barrier\n- Signal (Status: String)\n- Access\n\n### Relationships:\n- Staff Card is a type of Card\n- Guest Card is a type of Card\n- Access is a type of Card\n- Car Park contains Card Readers and Barriers\n- Card Reader controls Barrier and Signal\n- Card Reader reads Cards",
    "diagram": "@startuml\nclass Access {\n}\nclass Barrier {\n}\nclass \"Car Park\" {\n}\nclass Card {\n}\nclass \"Card Reader\" {\n}\nclass \"Guest Card\" {\n}\nclass Signal {\n}\nclass \"Staff Card\" {\n}\n\"Car Park\" o-- Barrier\n\"Car Park\" o-- \"Card Reader\"\n\"Card Reader\" o-- \"Guest Card\"\n\"Card reade\" o-- Signal\n\"Guest card\" --> Card\nBarrier --> Signal\nCard <|-- Access\nCard <|-- \"Staff Card\"\n@enduml"
  },
  {
    "id": 16,
    "title": "Banking Organizational Structure",
    "requirements": "This system provides the basic services to manage bank accounts at a bank called OOBank. After some research, they came up with the following requirements:\n    - OOBank has many branches, each of which has an address and branch number. A client opens accounts at a branch.\n    - Each account is uniquely identified by an account number; it has a balance and a credit or overdraft limit.\n    - There are many types of accounts, including: a mortgage account (which has a property as collateral), a checking account, and a credit card account (which has an expiry date and can have secondary cards attached to it).\n    - It is possible to have a joint account (e.g. for a husband and wife).\n    - Each type of account has a particular interest rate, a monthly fee and a specific set of privileges (e.g. ability to write checks, insurance for purchases etc.).\n    - OOBank is divided into divisions and subdivisions (such as Planning, Investments and Consumer); the branches are considered subdivisions of the Consumer Division.\n    - Each division has a manager and a set of other employees.\n    - Each customer is assigned a particular employee as his or her 'personal banker'.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Person (Name: String)\n- Employee\n- Customer\n- OrganizationalUnit\n- Branch (Number: String, Address: String)\n- Subdivision\n- Account (number: String, balance: Real, creditoroverdraftLimit: Real)\n- AccountType (InterestRate: Real, MonthlyFee: Real, checksAllowed: Boolean, insuranceAvailable: Boolean)\n- ChequingAccount\n- MortgageAccount (collateral: String)\n- CreditCardAccount (expiryDate: Date)\n- CreditCard (name: String)\n\n### Relationships:\n- Employee is a type of Person\n- Customer is a type of Person\n- Branch is a type of OrganizationalUnit\n- OrganizationalUnit contains Subdivisions\n- OrganizationalUnit employs Employees\n- Customer is assigned an Employee (Personal Banker)\n- Customer opens Account at a Branch\n- Account is of an AccountType\n- Chequing, Mortgage, and CreditCard accounts are types of Accounts\n- CreditCardAccount has CreditCards",
    "diagram": "@startuml\nclass Account {\n  balance\n  creditoroverdraftLimit\n  number\n}\nclass AccountType {\n  InterestRate\n  MonthlyFee\n  checksAllowed\n  insuranceAvailable\n}\nclass Branch {\n  Address\n  Number\n}\nclass ChequingAccount {\n}\nclass CreditCard {\n  name\n}\nclass CreditCardAccount {\n  expiryDate\n}\nclass Customer {\n}\nclass Employee {\n}\nclass MortgageAccount {\n  collateral Property\n}\nclass OrganizationalUnit {\n}\nclass Person {\n  Name\n}\nclass Subdivision {\n}\nAccountType --> Account\nBranch --> Account\nCreditCard --> CreditCardAccount\nCustomer --> Account\nEmployee --> Customer\nEmployee --> OrganizationalUnit\nOrganizationalUnit --> Employee\nOrganizationalUnit *-- Subdivision\nAccount <|-- ChequingAccount\nAccount <|-- CreditCardAccount\nAccount <|-- MortgageAccount\nOrganizationalUnit <|-- Branch\nPerson <|-- Customer\nPerson <|-- Employee\n@enduml"
  },
  {
    "id": 17,
    "title": "Prepaid Cell Phone (Decorator Pattern)",
    "requirements": "The contract of a prepaid cell phone should be modelled and implemented. After some research, they came up with the following requirements:\n    - A basic contract has a contract number (of type int) and a balance (of type double), but no monthly charges. The contract number is not automatically generated, but is to be set as a parameter by the constructor as well as the initial balance. The balance has a getter and a setter.\n    - The following options can be added to a contract (if needed also several times): 100 MB of data (monthly charge 1.00€), 50 SMS (monthly charge 0.50€), 50 minutes (monthly charge 1.50€), Double Transfer Rate (monthly charge 2.00€).\n    - Implement this requirement with the help of the decorator pattern. All contract elements should be able to understand the methods getCharges():double, getBalance():double and setBalance(double).\n    - The method getCharges() should provide the monthly charge of a contract with all its options selected. The methods getBalance() and setBalance() should be passed through and access the basic contract.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Contract\n- Basic Contract (contractNumber: Integer, Balance: Real)\n- Option\n- Data\n- SMS\n- Phone\n- Double Transfer\n- Client\n\n### Relationships:\n- Basic Contract is a type of Contract\n- Option is a type of Contract\n- Data, SMS, Phone, and Double Transfer are types of Options\n- Option wraps a Contract\n- Contract belongs to a Client",
    "diagram": "@startuml\nclass \"Basic Contract\" {\n  Balance\n  contractNumber\n}\nclass Client {\n}\nclass Contract {\n}\nclass Data {\n}\nclass \"Double Transfer\" {\n}\nclass Option {\n}\nclass Phone {\n}\nclass SMS {\n}\nContract --> Client\nContract --> Option\nOption <|-- Data\nOption <|-- \"Double Transfer\"\nOption <|-- Phone\nOption <|-- SMS\nContract --> \"Basic Contract\"\nContract --> Option\n@enduml"
  },
  {
    "id": 18,
    "title": "Library Management System",
    "requirements": "The exercise is to design a class structure for a library system. It should fulfil those requirements. After some research, they came up with the following requirements:\n    - There are two type of users – under-aged and adults.\n    - Under-aged users are identified with usage of their full name and student card.\n    - Adult users are identified with usage of their full name and ID card.\n    - The library contains books.\n    - There is basic information about every book (title, author, etc).\n    - The user can borrow at most 4 books at the same time.\n    - There is a history of previously borrowed books for every user (along with all the dates).",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- User (first_name: String, last_name: String)\n- Adult (id: String)\n- Under_aged (id_student: String)\n- Book (title: String, author: String)\n- Library\n- Borrow (Date: Date)\n\n### Relationships:\n- Adult is a type of User\n- Under_aged is a type of User\n- Library contains Books\n- User borrows Books\n- Borrow record links User and Book",
    "diagram": "@startuml\nclass Adult {\n  id\n}\nclass Book {\n  author\n  title\n}\nclass Borrow {\n  Date\n  book\n}\nclass Library {\n  Books\n}\nclass Under_aged {\n  id_student\n}\nclass User {\n  borrow_history\n  first_name\n  last_name\n}\nLibrary o-- Book\nUser o-- Borrow\nUser --> Book\nBook --> Borrow\nUser <|-- Adult\nUser <|-- Under_aged\n@enduml"
  },
  {
    "id": 19,
    "title": "MyDoctor Appointment Management",
    "requirements": "The MyDoctor application aims to be a management tool for the appointments of a doctor. After some research, they came up with the following requirements:\n    - A hospital has multiple offices.\n    - The users of the application can be doctors and patients.\n    - The doctors can apply to practice in offices and create a schedule for an office. The schedules in different offices can't overlay.\n    - Example: Doctor Ana is available in Office 4 on the 4th of September during 1 PM - 5PM. Doctor Ana can't practice in Office 5 on the 4th of September during 3PM - 8 PM, but she can practice in Office 5 on the 4th of September during 5:30PM - 8 PM.\n    - The patients can see the existing doctors in the system, the schedule of the offices and can book appointments for specific doctors and for specific schedules. The appointments can be of 3 types: Blood Test - 15 mins, Consultation - 30 mins, Surgery - 60 mins.\n    - The booking of an appointment will not be possible if another appointment is already booked at the same time frame. An email is sent to the patient with the confirmation of the appointment.\n    - Example: Action 1: User Mike will create a blood test booking for Doctor Ana for the 4th of September starting with 15:30 PM → Possible. Action 2: User Mike will create an intervention booking for Doctor Ana for the 4th of September starting with 15:00 PM → Not Possible. Action 3: User Mike will create an intervention booking for Doctor Ana for the 4th of September starting with 16:00 PM → Possible.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- User (id: String, FirstName: String, LastName: String)\n- Doctor (FieldOfActivity: String, graduationYear: Integer)\n- Patient\n- Office (id: String, Name: String)\n- Schedule (id: String, StartDate: DateTime, EndDate: DateTime)\n- Appointment (id: String, StartDate: DateTime, EndDate: DateTime)\n- BloodTest\n- Consultation\n- Surgery\n\n### Relationships:\n- Doctor is a type of User\n- Patient is a type of User\n- Office has Schedules\n- Schedule is assigned to a Doctor\n- Schedule contains Appointments\n- BloodTest, Consultation, and Surgery are types of Appointments\n- Appointment is booked by a Patient",
    "diagram": "@startuml\nclass Appointment {\n  EndDate\n  StartDate\n  id\n}\nclass BloodTest {\n}\nclass Consultation {\n}\nclass Doctor {\n  FieldOfActivity\n  graduationYear\n}\nclass Office {\n  Name\n  id\n}\nclass Patient {\n}\nclass Patienti {\n  Address\n  Age\n}\nclass Schedule {\n  EndDate\n  StartDate\n  id\n}\nclass Surgery {\n}\nclass User {\n  FirstName\n  LastName\n  id\n}\nAppointment o-- Patient\nOffice o-- Schedule\nSchedule o-- Doctor\nSchedule *-- Appointment\nAppointment <|-- BloodTest\nAppointment <|-- Consultation\nAppointment <|-- Surgery\nUser <|-- Doctor\nUser <|-- Patient\n@enduml"
  },
  {
    "id": 20,
    "title": "Online Shopping System",
    "requirements": "Model an online shopping system where customers can purchase items. After some research, they came up with the following requirements:\n    - Each customer has unique id and is linked to exactly one account. Account owns shopping cart and orders.\n    - Customer could register as a web user to be able to buy items online. Customer is not required to be a web user because purchases could also be made by phone or by ordering from catalogues. Web user has login name which also serves as unique id. Web user could be in several states - new, active, temporary blocked, or banned, and be linked to a shopping cart. Shopping cart belongs to account.\n    - Account owns customer orders. Customer may have no orders. Customer orders are sorted and unique. Each order could refer to several payments, possibly none. Every payment has unique id and is related to exactly one account.\n    - Each order has current order status. Both order and shopping cart have line items linked to a specific product. Each line item is related to exactly one product. A product could be associated to many line items or no item at all.",
    "plan": "## STRUCTURAL DECOMPOSITION\n\n### Classes:\n- Customer (id: String, address: String, email: String, phone: String)\n- Web User (login_id: String, password: String, state: String)\n- Account (id: String, billing_address: String, open: Date, closed: Date, is_closed: Boolean)\n- Shopping Cart (Created: Date)\n- Order (number: String, ordered: Date, shipped: Date, ship_to: String, status: String, total: Real)\n- LineItem (quantity: Integer, Price: Real)\n- Product (id: String, name: String, supplier: String)\n- Payment (id: String, paid: Date, total: Real, details: String)\n- OrderStatus\n- UserState\n\n### Relationships:\n- Web User is a type of Customer\n- Customer has an Account\n- Account owns Shopping Cart\n- Account owns Orders\n- Order contains LineItems\n- Shopping Cart contains LineItems\n- LineItem refers to a Product\n- Order has Payments\n- Payment belongs to an Account",
    "diagram": "@startuml\nclass Account {\n  billing_address\n  closed\n  id\n  is_closed\n  open\n}\nclass Customer {\n  address\n  email\n  id\n  phone\n}\nclass LineItem {\n  Price\n  quantity\n}\nclass Order {\n  number\n  ordered\n  ship_to\n  shipped\n  status\n  total\n}\nclass OrderStatus {\n}\nclass Payment {\n  details\n  id\n  paid\n  total\n}\nclass Product {\n  id\n  name\n  supplier\n}\nclass \"Shopping Cart\" {\n  Created\n}\nclass UserState {\n}\nclass \"Web User\" {\n  login_id\n  password\n  state\n}\nAccount --> Payment\nLineItem --> Product\nOrder --> LineItem\nPayment --> Order\n\"Shopping Cart\" --> LineItem\n\"Web User\" --> Customer\n\"Web User\" --> \"Shopping Cart\"\nAccount *-- Order\nAccount *-- \"Shopping Cart\"\nCustomer *-- Account\n@enduml"
  }
]